cases/old/on-fsi-2-Pc18068/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          192;
        startFace       16128;
    }
    fsi_pia
    {
        type            wall;
        inGroups        1(wall);
        nFaces          960;
        startFace       16320;
    }
    fsi_dura
    {
        type            wall;
        inGroups        1(wall);
        nFaces          960;
        startFace       17280;
    }
    fsi_sclera_peri
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       18240;
    }
    fsi_sclera_ring
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       18336;
    }
)

// ************************************************************************* //
